Revit 2026 API

# ElementParameterFilter(IListFilterRule, Boolean) Constructor

---

Initializes a new instance of the ElementParameterFilter class

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public ElementParameterFilter(
	IList<FilterRule> filterRules,
	bool inverted
)
```
```vb
Public Sub New (
	filterRules As IList(Of FilterRule),
	inverted As Boolean
)
```
```cpp
public:
ElementParameterFilter(
	IList<FilterRule^>^ filterRules,
	bool inverted
)
```
```fsharp
new :
        filterRules : IList<FilterRule> *
        inverted : bool -> ElementParameterFilter
```

#### Parameters

filterRules IListFilterRule

inverted Boolean

#### Reference

ElementParameterFilter Class

ElementParameterFilter Overload

Autodesk.Revit.DB Namespace